<template>
  <div class="py-8 px-4 bg-gray-50 space-y-3">
    <Container class="flex flex-col text-[#313131]">
      <div class="flex flex-row justify-between items-center pb-7 border-b border-b-gray-400">
        <a href="/" class="flex flex-row items-center">
          <LogoShort class="h-[30px]" />
          <span class="mx-7 w-px h-[30px] bg-gray-400"></span>
          <p>интернет-магазин</p>
        </a>
        <div class="flex flex-row gap-x-2.5">
          <a href="https://t.me/ttk_plus">
            <svg width="21" height="21" viewBox="0 0 21 21" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path
                d="M14.0997 8.12962C14.5827 7.64662 15.0622 6.51962 13.0497 7.88812C10.1902 9.86125 7.37186 11.7136 7.37186 11.7136C7.08175 11.8448 6.76811 11.916 6.44979 11.9229C6.13147 11.9298 5.81503 11.8723 5.51949 11.7539C4.31199 11.3916 2.90236 10.9086 2.90236 10.9086C2.90236 10.9086 1.93986 10.304 3.58749 9.66C3.58749 9.66 10.5534 6.80137 12.9692 5.79425C13.895 5.39175 17.0354 4.10375 17.0354 4.10375C17.0354 4.10375 18.4852 3.53937 18.3645 4.90875C18.3242 5.47225 18.0022 7.44625 17.6802 9.5795C17.1964 12.5991 16.6731 15.9014 16.6731 15.9014C16.6731 15.9014 16.5926 16.8271 15.9084 16.9881C15.1759 16.9757 14.4682 16.7209 13.8959 16.2636C13.7349 16.1429 10.8762 14.3307 9.82886 13.4452C9.72232 13.3731 9.63577 13.2751 9.57725 13.1605C9.51873 13.0459 9.49015 12.9184 9.49416 12.7897C9.49818 12.6611 9.53466 12.5356 9.60022 12.4248C9.66578 12.3141 9.75828 12.2218 9.86911 12.1564C11.3216 10.8281 13.0532 9.177 14.0997 8.12962Z"
                fill="#313131" />
            </svg>
          </a>
        </div>
      </div>
      <div class="flex flex-row justify-between border-b border-b-gray-400 py-5">
        <div class="flex flex-col">
          <p class="text-[#212121] pb-4 leading-[16px]">Навигация</p>
          <ol class="text-sm">
            <li class="leading-[14px] pb-2">
              Главная
            </li>
            <li class="leading-[14px] pb-2">
              Каталог
            </li>
          </ol>
        </div>
        <div class="flex flex-col">
          <p class="text-[#212121] pb-4 leading-[16px]">Контакты</p>
          <ol class="text-sm">
            <li class="leading-[14px] pb-2 flex flex-col">
              <a href="tel:+7(924)676-79-67">+7 (924) 676-79-67</a>
              <p>Никита | </p>
            </li>
            <li class="leading-[14px] pb-2 flex flex-col">
              <a href="tel:+7(914)569-21-81">+7 (914) 569-21-81</a>
              <p>Алексей | </p>
            </li>
            <!-- <li class="leading-[14px] pb-2 flex flex-col">
              <a href="tel:+7(914)619-12-30">+7 (914) 619-12-30</a>
              <p>Андрей | Менеджер</p>
            </li>
            <li class="leading-[14px] pb-2 flex flex-col">
              <a href="tel:+7(914)043-89-22">+7 (914) 043-89-22</a>
              <p>Валерий | Менеджер</p>
            </li> -->
          </ol>
        </div>
      </div>
      <!-- <div class="grid grid-cols-1 gap-y-4 lg:grid-cols-3 lg:gap-y-0 lg:gap-x-8">
        <div class="flex flex-col">
          <h1 class="text-xl font-inter font-semibold pb-4 lg:pb-6">Контакты</h1>
          <div class="space-y-4 lg:space-y-5">
            <div class="flex flex-col">
              <span>Фактический адрес</span>
              <span>
                675002, Амурская обл, г Благовещенск, ул. Горького, д. 1, с. 3
              </span>
            </div>
            <div class="flex flex-col">
              <span>Юридический адрес</span>
              <span>
                675002, Амурская обл, г Благовещенск, ул. Горького, д. 1, с. 3
              </span>
            </div>
          </div>
          <div class="pt-4 lg:pt-6">
            <a href="tel:+79140438922">
              <el-button type="primary"> Связаться с нами </el-button>
            </a>
          </div>
        </div>
        <div class="flex flex-col">
          <h1 class="text-xl font-inter font-semibold pb-4 lg:pb-6">
            Информация
          </h1>
          <div class="space-y-4 lg:space-y-5">
            <div class="flex flex-col">
              <span>
                Если возникли вопросы - звоните по будням с 10:00 до 17:00 по
                телефону:
              </span>
              <div class="flex flex-col items-start md:flex-row md:gap-x-2">
                <el-link type="primary" href="tel:+79140438922"> +7 (914)-043-89-22 </el-link>
                <el-link type="primary" href="tel:+79145992961"> +7 (914)-599-29-61 </el-link>
                <el-link type="primary" href="tel:+79146191230"> +7 (914)-619-12-30 </el-link>
              </div>
            </div>
            <div class="flex flex-col">
              <span>Либо пишите запрос на <el-link type="primary" href="mailto:info@dv-ttk.ru">info@dv-ttk.ru</el-link>
              </span>
              <span>
                и мы свяжемся с вами в удобное для Вас время, удобным для Вас
                способом.
              </span>
            </div>

            <a href="/documents/rekvizity-organizatsii.pdf" download="rekvizity-organizatsii.pdf">
              <div class="flex flex-rowe leading-8 space-x-1">
                <i>
                  <svg width="32" height="32" viewBox="0 0 32 32" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path
                      d="M26.7062 9.02188C26.8937 9.20938 27 9.4625 27 9.72812V29C27 29.5531 26.5531 30 26 30H6C5.44687 30 5 29.5531 5 29V3C5 2.44687 5.44687 2 6 2H19.2719C19.5375 2 19.7938 2.10625 19.9813 2.29375L26.7062 9.02188V9.02188ZM24.6938 10.1875L18.8125 4.30625V10.1875H24.6938ZM19.7881 19.9144C19.3137 19.8988 18.8094 19.9353 18.2366 20.0069C17.4772 19.5384 16.9659 18.895 16.6028 17.9497L16.6362 17.8128L16.675 17.6509C16.8094 17.0844 16.8816 16.6709 16.9031 16.2541C16.9194 15.9394 16.9019 15.6491 16.8459 15.38C16.7428 14.7991 16.3319 14.4594 15.8141 14.4384C15.3312 14.4187 14.8875 14.6884 14.7741 15.1062C14.5894 15.7819 14.6975 16.6709 15.0891 18.1872C14.5903 19.3762 13.9312 20.7703 13.4891 21.5478C12.8987 21.8522 12.4391 22.1291 12.0528 22.4359C11.5434 22.8413 11.2253 23.2578 11.1378 23.6953C11.0953 23.8981 11.1594 24.1631 11.3053 24.3803C11.4709 24.6266 11.7203 24.7866 12.0194 24.8097C12.7741 24.8681 13.7016 24.09 14.7256 22.3328C14.8284 22.2984 14.9372 22.2622 15.07 22.2172L15.4419 22.0916C15.6772 22.0122 15.8478 21.9553 16.0166 21.9006C16.7478 21.6625 17.3009 21.5122 17.8041 21.4266C18.6784 21.8947 19.6891 22.2016 20.3697 22.2016C20.9316 22.2016 21.3112 21.9103 21.4484 21.4519C21.5687 21.0494 21.4734 20.5825 21.2147 20.3244C20.9472 20.0616 20.4553 19.9359 19.7881 19.9144V19.9144ZM12.0384 23.9275V23.9163L12.0425 23.9056C12.0882 23.7874 12.1469 23.6746 12.2175 23.5694C12.3512 23.3637 12.5353 23.1475 12.7634 22.9172C12.8859 22.7937 13.0134 22.6734 13.1631 22.5384C13.1966 22.5084 13.4103 22.3181 13.4503 22.2806L13.7994 21.9556L13.5456 22.3597C13.1606 22.9734 12.8125 23.4153 12.5144 23.7034C12.4047 23.8097 12.3081 23.8878 12.23 23.9381C12.2042 23.9554 12.1769 23.9702 12.1484 23.9825C12.1356 23.9878 12.1244 23.9909 12.1131 23.9919C12.1012 23.9934 12.0892 23.9918 12.0781 23.9872C12.0664 23.9823 12.0563 23.974 12.0493 23.9633C12.0422 23.9527 12.0384 23.9403 12.0384 23.9275V23.9275ZM15.9741 17.1063L15.9034 17.2313L15.8597 17.0944C15.7628 16.7872 15.6916 16.3244 15.6719 15.9069C15.6494 15.4319 15.6872 15.1469 15.8372 15.1469C16.0478 15.1469 16.1444 15.4844 16.1519 15.9922C16.1587 16.4384 16.0884 16.9028 15.9738 17.1063H15.9741ZM15.7925 18.9331L15.8403 18.8066L15.9056 18.9253C16.2709 19.5891 16.745 20.1428 17.2663 20.5287L17.3787 20.6119L17.2416 20.64C16.7312 20.7456 16.2559 20.9044 15.6059 21.1666C15.6738 21.1391 14.9303 21.4434 14.7422 21.5156L14.5781 21.5784L14.6656 21.4259C15.0516 20.7541 15.4081 19.9472 15.7922 18.9331H15.7925ZM20.7181 21.3162C20.4725 21.4131 19.9437 21.3266 19.0128 20.9291L18.7766 20.8284L19.0328 20.8097C19.7609 20.7556 20.2766 20.7956 20.5772 20.9056C20.7053 20.9525 20.7906 21.0116 20.8284 21.0791C20.8483 21.111 20.855 21.1495 20.8471 21.1863C20.8392 21.2231 20.8172 21.2553 20.7859 21.2763C20.7661 21.2938 20.7431 21.3073 20.7181 21.3162V21.3162Z"
                      fill="#E43A3A" />
                  </svg>
                </i>
                <span> Посмотреть и скачать реквизиты </span>
              </div>
            </a>

          </div>
        </div>
        <div class="flex flex-col">
          <nuxt-link class="font-inter font-semibold pb-4 lg:pb-6" :to="{ name: 'index' }">
            Главная
          </nuxt-link>
          <nuxt-link class="font-inter font-semibold" :to="{ name: 'products' }">
            Каталог
          </nuxt-link>
        </div>
      </div> -->
      <div class="flex flex-row justify-between items-center pt-5">
        <p class="font-inter text-sm">© Интернет-магазин ТТК+ Запчасти | {{ year }}</p>
        <a href="mailto:info@dv-ttk.ru" class="font-inter">info@dv-ttk.ru</a>
      </div>
    </Container>

  </div>
</template>

<script>

export default {
  data() {
    return {
      year: 0
    }
  },
  mounted() {
    let date = new Date()
    this.year = date.getFullYear()
  }
}
</script>

<style>
</style>
